---
# Crash Course Python for Data Science - Intro to Pandas 
---
# 01 - Loading Data 
---

### Begin by importing your tools

In [4]:
# Let's begin by importing pandas
import pandas as pd

In [5]:
# help(pd.read_csv)

In [6]:
?pd.read_csv

## Reading in Your Data
Pandas has methods to read different types of data files and turn them into a DataFrame. In practice, you could be pulling data from different databases, different websites, your local computer, or a combination of all the above. For our purposes in this crash course, we'll focus on the most common pandas method:  
**`pandas.read_csv()`**

CSV stands for "comma separated values." If you've ever used Microsoft Excel or Google Sheets, for example, you've used CSV files. Keep this link to the documentation handy. Learning how to read documentation will become an invaluable asset in your journey.
[Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

### Load a Dataset via its URL

In [7]:
# We use the pandas method pandas.read_csv("filepath") to create a DataFrame 
# and assign it to a variable:

df = pd.read_csv("https://raw.githubusercontent.com/axrd/datasets/master/sales_data.csv")
df.to_csv(r'D:\01 Graduated Studen\MYCLASS\Undergraduate\ThirdTwo\data.csv', index=False)
# Why do you think we assigned the new DataFrame to a variable? 

print(df.shape)
df.head()
# df[0:19]

(100, 6)

,Unnamed: 0,Name,Region,Company,Date,Sales
0,0,Brenden Cote,Central African Republic,Metus Corp.,"Feb 17, 2018",67044
1,1,Justina Reed,Namibia,Lobortis Ltd,"Apr 27, 2017",89517
2,2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670

In [8]:
from google.colab import drive
drive.mount('/content/drive')

ModuleNotFoundError: No module named 'google'

### Load a Dataset from your local machine

Take a look at the folder where this dataset can be found on GitHub: [sales_data.csv](https://github.com/axrd/datasets/blob/master/sales_data.csv).

In [10]:
from google.colab import files
files.upload()

ModuleNotFoundError: No module named 'google'

In [11]:
df = pd.read_csv('vsales_data.csv')

print(df.shape)
df.head()

FileNotFoundError: [Errno 2] No such file or directory: 'vsales_data.csv'

## Heads or Tails?
The cell ran...but how do we know if we got our data?
Pandas has a few methods that can help us verify:  

`dataframe.head()`  

Will show us the ***first*** 5 rows of our dataframe, we can pass an integer value into the parenthesis to see a specific number of rows.

`dataframe.tail()`

Will show us the ***last*** 5 rows of our dataframe, we can pass an integer value into the parenthesis to see a specific number of rows.

In [12]:
# Look at the first 5 rows:
df.head()

,Unnamed: 0,Name,Region,Company,Date,Sales
0,0,Brenden Cote,Central African Republic,Metus Corp.,"Feb 17, 2018",67044
1,1,Justina Reed,Namibia,Lobortis Ltd,"Apr 27, 2017",89517
2,2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670

In [13]:
# Look at the last 5 rows:

df.tail()

,Unnamed: 0,Name,Region,Company,Date,Sales
95,95,Mara Beck,Holy See (Vatican City State),Mauris Ut LLC,"Jul 28, 2016",33709
96,96,Ainsley Shaw,Seychelles,Ligula Nullam Corp.,"Dec 5, 2017",29564
97,97,Libby Lindsey,Qatar,Convallis Corp.,"Nov 5, 2016",10583
98,98,Cody Langley,Isle of Man,Est Mollis Company,"Oct 9, 2017",98167
99,99,Colt Schultz,Guadeloupe,Dolor Nonummy Inc.,"Nov 18, 2017",39988

Hmm...it looks like we may have two indexes. We'll fix that a little later. 

Right now, notice that df.head() and df.tail() return the first five rows and the last five rows of the DataFrame, respectively. But what if I wanted to see the first ten rows?

In [14]:
df.tail(10)

,Unnamed: 0,Name,Region,Company,Date,Sales
90,90,Steel Andrews,Togo,Sed Dictum Eleifend Industries,"Sep 11, 2016",68311
91,91,Chelsea Pollard,Malawi,Cras Convallis PC,"May 23, 2016",55208
92,92,Beverly Goodman,Gibraltar,Fringilla Company,"Mar 24, 2017",80038
93,93,Keiko Sexton,Cambodia,Ligula Aenean Industries,"Jan 11, 2018",6974
94,94,Doris Mcgee,Macao,Urna Corp.,"May 28, 2016",12070
95,95,Mara Beck,Holy See (Vatican City State),Mauris Ut LLC,"Jul 28, 2016",33709
96,96,Ainsley Shaw,Seychelles,Ligula Nullam Corp.,"Dec 5, 2017",29564
97,97,Libby Lindsey,Qatar,Convallis Corp.,"Nov 5, 2016",10583
98,98,Cody Langley,Isle of Man,Est Mollis Company,"Oct 9, 2017",98167
99,99,Colt Schultz,Guadeloupe,Dolor Nonummy Inc.,"Nov 18, 2017",39988

The head() method takes in a parameter that tells it how many rows to return (from the top). The tail() method has the same parameters, but from the bottom instead.

From our head() and tails() output we can see that we have people, regions, companies, dates, and sales numbers. Let's say we knew that this data was supposed to have 100 rows and 5 columns. How could we verify that we imported the data correctly?

In [15]:
# Pandas DataFrames have the same useful attribute as Numpy ndarrays: shape.
df.shape

(100, 6)

We already knew this, but we've got one extra column (the duplicate index). Don't worry, this can happen! Fortunately, data frames have a method to drop columns.

In [16]:
# Use the dataframe.columns attribute to get a series of the column names:
df.columns

Index(['Unnamed: 0', 'Name', 'Region', 'Company', 'Date', 'Sales'], dtype='object')

In [17]:
# If we just want a list of the column headers we can cast the index to a list
list(df.columns)

['Unnamed: 0', 'Name', 'Region', 'Company', 'Date', 'Sales']

In [18]:
# We need to drop the first column, but it's Unnamed so we need to use its index value.
# Remember that index values begin at 0!

df.columns[0]

'Unnamed: 0'

In [19]:
# Using the dataframe.drop() method:

# The the following two lines of code are equivalent
df.drop(df.columns[0])
# df.drop('Unnamed: 0')

KeyError: "['Unnamed: 0'] not found in axis"

### Axis? What's that all about?  
### This:
![atext](https://i.stack.imgur.com/dcoE3.jpg)  
If you check the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html), you'll see that DataFrame.drop() has "axis = 0" as a default. We need to explicitly (remember the Zen of Python?) tell pandas to look for the column we want to drop from the column axis, which is column 1.

In [20]:
# Second time's the charm!

df.drop(df.columns[0], axis=1)

,Name,Region,Company,Date,Sales
0,Brenden Cote,Central African Republic,Metus Corp.,"Feb 17, 2018",67044
1,Justina Reed,Namibia,Lobortis Ltd,"Apr 27, 2017",89517
2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670
...,...,...,...,...,...
95,Mara Beck,Holy See (Vatican City State),Mauris Ut LLC,"Jul 28, 2016",33709
96,Ainsley Shaw,Seychelles,Ligula Nullam Corp.,"Dec 5, 2017",29564
97,Libby Lindsey,Qatar,Convallis Corp.,"Nov 5, 2016",10583
98,Cody Langley,Isle of Man,Est Mollis Company,"Oct 9, 2017",98167
99,Colt Schultz,Guadeloupe,Dolor Nonummy Inc.,"Nov 18, 2017",39988

In [21]:
# We did it! Wait... Why is it still there? ðŸ¤”

df.head()

,Unnamed: 0,Name,Region,Company,Date,Sales
0,0,Brenden Cote,Central African Republic,Metus Corp.,"Feb 17, 2018",67044
1,1,Justina Reed,Namibia,Lobortis Ltd,"Apr 27, 2017",89517
2,2,Daquan Vinson,Svalbard and Jan Mayen Islands,A Mi Consulting,"Aug 14, 2016",62705
3,3,Connor Shelton,Niue,Parturient Consulting,"Feb 13, 2017",12675
4,4,Drew Carlson,Mayotte,Interdum Associates,"Sep 26, 2017",86670

### Not quite...
### Pandas will almost always perform the operation and then return a copy of the changed DataFrame. But the original DataFrame is still the same. We need to override that! 
We can accomplish this a few different ways; the easiest is making the change _in place_.

In [22]:
df.drop(df.columns[0], axis=1, inplace=True)

In [23]:
# I suggest using this approach: 
df = df.drop(df.columns[0], axis=1)

In [24]:
# Third time's the charm?
df.head()

                           Region                Company          Date  Sales
0        Central African Republic            Metus Corp.  Feb 17, 2018  67044
1                         Namibia           Lobortis Ltd  Apr 27, 2017  89517
2  Svalbard and Jan Mayen Islands        A Mi Consulting  Aug 14, 2016  62705
3                            Niue  Parturient Consulting  Feb 13, 2017  12675
4                         Mayotte    Interdum Associates  Sep 26, 2017  86670

## Renaming a Column
On closer inspection, the column "Region" should really be called "Country." Let's make that happen, _in place_.

In [25]:
df.rename(columns={'Region':'Country'}, inplace=True)

In [26]:
df.head()

                          Country                Company          Date  Sales
0        Central African Republic            Metus Corp.  Feb 17, 2018  67044
1                         Namibia           Lobortis Ltd  Apr 27, 2017  89517
2  Svalbard and Jan Mayen Islands        A Mi Consulting  Aug 14, 2016  62705
3                            Niue  Parturient Consulting  Feb 13, 2017  12675
4                         Mayotte    Interdum Associates  Sep 26, 2017  86670

### Remember to practice all this in your exercise!